import random
import requests
from time import sleep
from bs4 import BeautifulSoup

def larissa(name):
	param = {
		"u":name
	}
	ht = requests.post("https://shindanmaker.com/749828",param)

	soup = BeautifulSoup(ht.text, "html.parser")
	result = soup.find("div",class_="result2").find("div").text
	return result.strip()

def randSleep():
	#ランダム待ち
	sec = random.randint(3,5)
	sleep(sec)
	
def main():
	print('武田羅梨沙多胡さんチャレンジ開始！！')
	names = ['saru','SARU','さる','おさる','おさるのまーち',
	'猿','お猿','お猿のマーチ','をさる','お猿だそうさ',
	'おさるだそうさ','さるまーち','さるさる','さるを','さるぎゃー',
	'さるっち','を猿','申','SaRu','osaru',
	'OSARU','y-osaru','Y-OSARU','saru_frep','Sarch',
	'さるぼー','サルボー','さるぼん','サルボン','さるぼ',
	'サルボ','さるほーて','サルホーテ','さるもん','サルモン',
	'さーるん','サールン','さるんとん','サルントン','さるまーに',
	'さるる','サルル','さるらんち','サルランチ','サルマーニ',
	'SAL','SALU','sal','salu','S@RU',
	'sa@ru','さるりーまん','サルリーマン','さるかちょう','サルカチョウ',
	'さるぶちょう','サルブチョウ','さるさん','サルサン','SARUさん',
	'saruさん','さるくん','サルくん','SARUくん','saruくん',
	'S∀RU','さるちゃん','サルちゃん','SARUちゃん','saruちゃん',
	'y-osaru-frep','y_osaru','SA_RU','SAωRU','sa_ru',
	'saωru','さるきち','サルきち','サルキチ','猿吉',
	'サル吉','さる吉','猿之助','さるのすけ','サルノスケ',
	'ＳＡＲＵ','ｓａｒｕ','ｏｓａｒｕ','ＯＳＡＲＵ','SA@RU',
	'さるびあーん','サルビア','さるびあ','さるすきー','サルスキー',
	'ｻﾙﾎﾞｰ','ｻﾙﾎﾞﾝ','ｻﾙﾎﾞ','ｻﾙﾎｰﾃ','ｻﾙﾓﾝ',
	'ｻﾙﾙ','ｻﾙﾗﾝﾁ','ｻﾙﾏｰﾆ','ｻﾙﾘｰﾏﾝ','ｻﾙｶﾁｮｳ',
	'ｻﾙﾌﾞﾁｮｳ','ｻﾙｻﾝ','サルクン','ｻﾙｸﾝ','サルチャン',
	'ｻﾙﾁｬﾝ','さるかっちゃん','ｻﾙｶｯﾁｬﾝ','サルカッチャン','猿化剤',
	'さるかざい','サルカザイ','ｻﾙｶｻﾞｲ','ｻﾙｷﾁ','ｻﾙﾉｽｹ',
	'ｻﾙﾋﾞｱ','ｻﾙｽｷｰ','さるすき','サルスキ','さるのぼ',
	'さるのぼー','サルノボ','サルノボー','ｻﾙﾉﾎﾞ','ｻﾙﾉﾎﾞｰ',
	'サルビアー','さるびあー','ｻﾙﾋﾞｱｰ','さるわいん','サルワイン',
	'ｻﾙﾜｲﾝ','さるじん','サルジン','ｻﾙｼﾞﾝ','猿人',
	'さる人','サル人','さるひと','サルヒト','ｻﾙﾋﾄ',
	'さるんです','サルンデス','ｻﾙﾝﾃﾞｽ','さるです','サルデス',
	'ｻﾙﾃﾞｽ','さるとりびゅーと','さるトリビュート','サルトリビュート','ｻﾙﾄﾘﾋﾞｭｰﾄ',
	'さるほー','サルホー','ｻﾙﾎｰ','さるえっじ','サルエッジ',
	'ｻﾙｴｯｼﾞ','さるえる','サルエル','ｻﾙｴﾙ','さるちるさん',
	'サルチルサン','ｻﾙﾁﾙｻﾝ','サルチル酸','さるちるさんめちる','ｻﾙﾁﾙｻﾝﾒﾁﾙ',
	'サルチル酸メチル','さるち','サルチ','ｻﾙﾁ','さるちー',
	'ｻﾙﾁｰ','サルチー','さるんです','サルンデス','ｻﾙﾝﾃﾞｽ',
	'さるどん','サルドン','ｻﾙﾄﾞﾝ','さるばん','サルバン',
	'ｻﾙﾊﾞﾝ','さるつん','サルツン','ｻﾙﾂﾝ','さるつくりん',
	'サルツクリン','ｻﾙﾂｸﾘﾝ','さるゆず','サルユズ','ｻﾙﾕｽﾞ',
	'さるた','サルタ','ｻﾙﾀ','猿田','猿田彦',
	'さるばとーれ','サルバトーレ','ｻﾙﾊﾞﾄｰﾚ','さるゔぁとーれ','サルヴァトーレ',
	'ｻﾙｳﾞｧﾄｰﾚ','さるゔぁ','サルヴァ','ｻﾙｳﾞｧ','サルバ',
	'さるば','ｻﾙﾊﾞ','さるてぃねす','サルティネス','ｻﾙﾃｨﾈｽ',
	'さるでぃーに','サルディーニ','ｻﾙﾃﾞｨｰﾆ','さるらす','サルラス',
	'ｻﾙﾗｽ','さるこん','サルコン','ｻﾙｺﾝ','さるしっちゃ',
	'サルシッチャ','ｻﾙｼｯﾁｬ','さるだむ','サルダム','ｻﾙﾀﾞﾑ',
	'猿魂','さるいわ','猿岩','猿岩石','さるがんせき',
	'サルガンセキ','ｻﾙｶﾞﾝｾｷ','さるすべり','サルスベリ','ｻﾙｽﾍﾞﾘ',
	'さるのこしかけ','サルノコシカケ','ｻﾙﾉｺｼｶｹ','さるさ','サルサ',
	'ｻﾙｻ','さるさそーす','サルサソース','ｻﾙｻｿｰｽ','サルパ',
	'さるぱ','ｻﾙﾊﾟ','さるべーじ','サルベージ','ｻﾙﾍﾞｰｼﾞ',
	'さるもねら','サルモネラ','ｻﾙﾓﾈﾗ','さるとる','サルトル',
	'ｻﾙﾄﾙ','さるかっそー','サルカッソー','ｻﾙｶｯｿｰ','サルガッソー',
	'さるがっそー','ｻﾙｶﾞｯｿｰ','猿コルファ','さるこるふぁ','サルコルファ',
	'ｻﾙｺﾙﾌｧ','さるっさー','サルッサー','ｻﾙｯｻｰ','猿沢',
	'さるさわ','サルサワ','ｻﾙｻﾜ','さるとんぼ','さるトンボ',
	'猿蜻蛉','猿トンボ','サルトンボ','ｻﾙﾄﾝﾎﾞ','さるとん',
	'ｻﾙﾄﾝ','サルトン','猿豚','サルブタモール','さるぶたもーる',
	'ｻﾙﾌﾞﾀﾓｰﾙ','さるしま','猿島','サルシマ','ｻﾙｼﾏ',
	'さるしっと','サルシット','ｻﾙｼｯﾄ','さるいち','サルイチ',#300件(100*(1-(1-(1/7^7))^300)=0.036%……)
	]
	random.shuffle(names)
	print(names)
	
	for index,name in enumerate(names):
		#診断
		result = larissa(name)
		
		if result == "武田羅梨沙多胡":
			print(str(index)+'：成功！：'+name+'/'+result)
			break
		else:
			print(str(index)+'：失敗！：'+name+'/'+result)
			randSleep()
	print('終了！！！！')

if __name__ == '__main__':
	main()